app/Models/Membarques.php

    public function listartotalpallet2($id) {
        // code...
        $builder = $this->db->table('t_pallet_embarque');
        $builder->select('*');
        $builder->where('embarque_id', $id);
        return $builder->get()->getResult();
---
SELECT *
FROM `t_pallet_embarque`
WHERE `embarque_id` = ('1')

    public function listarpedidos() {
        // code...
        $builder = $this->db->table('t_pedidos');
        $builder->select('*');
        return $builder->get()->getResult();
---
SELECT *
FROM `t_pedidos`

    public function listarpallet($id) {
        // code...
        $builder = $this->db->table('t_pallet_embarque');
        $builder->select("* , GROUP_CONCAT(calibre, ' - ',cantidad, '<br>') AS todos");
        $builder->where('embarque_id', $id);
        $builder->groupBy('numero_pallet');
        $builder->orderBy('id_embarques_pallet');
        $query = $builder->get()->getResult();
---
SELECT *, GROUP_CONCAT(calibre, ' - ', `cantidad`, '<br>') AS todos
FROM `t_pallet_embarque`
WHERE `embarque_id` = ('1')
GROUP BY `numero_pallet`

    public function sumarTotalpallet($id) {
        // code...
        $builder = $this->db->table('t_pallet_embarque');
        $builder->select("* ,SUM(cantidad) AS total, GROUP_CONCAT(DISTINCT calibre,' - ',cantidad, '<br>') AS todoss");
        $builder->where('embarque_id', $id);
        $builder->groupBy('pedido');
        $query = $builder->get()->getResult();
---
SELECT *, SUM(cantidad) AS total, GROUP_CONCAT(DISTINCT calibre, ' - ', `cantidad`, '<br>') AS todoss
FROM `t_pallet_embarque`
WHERE `embarque_id` = ('1')
GROUP BY `pedido`