app/Models/Mrastreos.php

SELECT *
FROM `t_rastreos`
JOIN `t_pallet` ON `t_pallet`.`codigo_rastreo` = `t_rastreos`.`codigo`
WHERE `id_rastreo` = ('11')
---
    public function listarpalletArray($data) {
        // code...
        $builder = $this->db->table('t_rastreos');
        $builder->select('*');
        $builder->join('t_pallet', 't_pallet.codigo_rastreo = t_rastreos.codigo');
        $builder->where('id_rastreo', $data);
        $query = $builder->get()->getResultArray();

SELECT *
FROM `t_rastreos`
JOIN `t_pallet` ON `t_pallet`.`codigo_rastreo` = `t_rastreos`.`codigo`
WHERE `id_rastreo` = ('11')
---
    public function listarpallet($data) {
        // code...
        $builder = $this->db->table('t_rastreos');
        $builder->select('*');
        $builder->join('t_pallet', 't_pallet.codigo_rastreo = t_rastreos.codigo');
        $builder->where('id_rastreo', $data);
        $query = $builder->get()->getResult();

SELECT *
FROM `t_lotes`
JOIN `t_pallet` ON `t_lotes`.`lote` = `t_pallet`.`lote`
WHERE `codigo_rastreo` = 'PM22008'
GROUP BY `corredor`
---
    public function listarlote($dato) {
        // code...
        $builder = $this->db->table('t_lotes');
        $builder->select('*');
        $builder->join('t_pallet', 't_lotes.lote = t_pallet.lote');
        $builder->where('codigo_rastreo', $dato);
        $builder->groupBy('corredor');
        $query = $builder->get()->getResult();